In [2]:
import numpy as np
import pandas as pd

In [3]:
# Creating a data frame from a dicitionary

In [4]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [5]:
df = pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna()    # If any of these ROWS has a null value init, it'll drop them

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1)   # If any of these COLUMNS has a null value, it'll drop them

   C
0  1
1  2
2  3

In [9]:
df.dropna(thresh=2)    # Because row 1 has atleast 2 non NaN values, it went ahead & kept that row

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
# To fill in missing values
df.fillna(value='RISEB')     # Fill in with RISEB

       A      B  C
0    1.0    5.0  1
1    2.0  RISEB  2
2  RISEB  RISEB  3

In [12]:
# Fill in NaN with Mean of the column
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64